Rechnerubung/Week7/Parameterstudien_mit_RANS/data/raw/AOA_9/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

#include "../system/globalVariables";

// //define turbulence intensity at inlet
// intensity	0.005; //Turbulence Intensity for External Flow and Airfoils are much below 1%
// mag_U_infty	15.62;

// //calculate k
// k_inlet		#calc "(3/2)*pow($mag_U_infty*$intensity,2)";

// beta_1		0.0750;			//Got value from linked study in Uebung
// nu		1.562e-05;		//nu at SATP
// del_y_1		0.06106643254088557;	//jet half width
// omega		#calc "10*((6*$nu)/($beta_1*pow($del_y_1,2)))";	//Equation snippet given in Uebung sheet

// nut		#calc "$k_inlet/$omega";

internalField   uniform $nut;

boundaryField
{
    inlet
    {
        type            calculated;
        value		uniform $nut;
    }

    outlet
    {
        type            calculated;
	value		uniform $nut;
    }

    suction_side
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    pressure_side
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    trailing_edge
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
